
import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица Австралии?',
    correctAnswerIndex: 2,
    options: [
      'а) Мельбурн',
      'б) Сидней',
      'в) Канберра',
      'г) Бризбен',
    ],
  ),
  Question(
    question: '2. Какое животное является символом Австралии?',
    correctAnswerIndex: 0,
    options: [
      'а) Кенгуру',
      'б) Панда',
      'в) Слон',
      'г) Орел',
    ],
  ),
  Question(
    question: '3. Как называется знаменитый риф, расположенный у побережья Австралии?',
    correctAnswerIndex: 1,
    options: [
      'а) Барьерный риф Флориды',
      'б) Большой Барьерный риф',
      'в) Коралловый риф Бали',
      'г) Риф Карибского моря',
    ],
  ),
  Question(
    question: '4. Какой город является крупнейшим в Австралии по населению?',
    correctAnswerIndex: 1,
    options: [
      'а) Канберра',
      'б) Сидней',
      'в) Мельбурн',
      'г) Перт',
    ],
  ),
  Question(
    question: '5. Как называется пустыня, расположенная в центральной части Австралии?',
    correctAnswerIndex: 3,
    options: [
      'а) Пустыня Сахара',
      'б) Пустыня Гоби',
      'в) Пустыня Калахари',
      'г) Пустыня Виктория',
    ],
  ),
  Question(
    question: '6. Как называется крупнейший остров, являющийся частью Австралии?',
    correctAnswerIndex: 0,
    options: [
      'а) Тасмания',
      'б) Гренландия',
      'в) Мадагаскар',
      'г) Новая Гвинея',
    ],
  ),
  Question(
    question: '7. Какое австралийское животное известно своим характерным смехом?',
    correctAnswerIndex: 2,
    options: [
      'а) Коала',
      'б) Вомбат',
      'в) Кукабарра',
      'г) Эму',
    ],
  ),
  Question(
    question: '8. Какая знаменитая скала является одной из главных достопримечательностей Австралии?',
    correctAnswerIndex: 3,
    options: [
      'а) Гора Фудзи',
      'б) Эверест',
      'в) Килиманджаро',
      'г) Улуру',
    ],
  ),
  Question(
    question: '9. Какое морское животное можно встретить у берегов Австралии в сезон миграции?',
    correctAnswerIndex: 1,
    options: [
      'а) Белый медведь',
      'б) Горбатый кит',
      'в) Пингвин',
      'г) Морской котик',
    ],
  ),
];