
import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица Бразилии?',
    correctAnswerIndex: 2,
    options: [
      'а) Сан-Паулу',
      'б) Рио-де-Жанейро',
      'в) Бразилиа',
      'г) Салвадор',
    ],
  ),
  Question(
    question: '2. Как называется крупнейший лесной массив, расположенный в Бразилии?',
    correctAnswerIndex: 0,
    options: [
      'а) Амазонский лес',
      'б) Конголезский лес',
      'в) Таежный лес',
      'г) Борнео',
    ],
  ),
  Question(
    question: '3. Какая река является крупнейшей в Бразилии и одной из крупнейших в мире?',
    correctAnswerIndex: 1,
    options: [
      'а) Нил',
      'б) Амазонка',
      'в) Миссисипи',
      'г) Янцзы',
    ],
  ),
  Question(
    question: '4. Какой официальный язык в Бразилии?',
    correctAnswerIndex: 1,
    options: [
      'а) Испанский',
      'б) Португальский',
      'в) Английский',
      'г) Французский',
    ],
  ),
  Question(
    question: '5. Как называется знаменитый карнавал, проходящий в Бразилии?',
    correctAnswerIndex: 2,
    options: [
      'а) Марди Гра',
      'б) Венецианский карнавал',
      'в) Карнавал в Рио',
      'г) Октоберфест',
    ],
  ),
  Question(
    question: '6. Как называется крупнейшая гора в Бразилии?',
    correctAnswerIndex: 3,
    options: [
      'а) Маунт Косцюшко',
      'б) Маунт Витория',
      'в) Гора Эверест',
      'г) Пико да Неблина',
    ],
  ),
  Question(
    question: '7. Как называется знаменитый стадион в Рио-де-Жанейро?',
    correctAnswerIndex: 1,
    options: [
      'а) Камп Ноу',
      'б) Маракана',
      'в) Уэмбли',
      'г) Сан-Сиро',
    ],
  ),
  Question(
    question: '8. Какой популярный бразильский танец известен во всем мире?',
    correctAnswerIndex: 0,
    options: [
      'а) Самба',
      'б) Танго',
      'в) Фламенко',
      'г) Вальс',
    ],
  ),
  Question(
    question: '9. Как называется бразильское боевое искусство, сочетающее элементы танца и акробатики?',
    correctAnswerIndex: 2,
    options: [
      'а) Дзюдо',
      'б) Кунг-фу',
      'в) Капоэйра',
      'г) Карате',
    ],
  ),
];