import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица Эфиопии?',
    correctAnswerIndex: 0,
    options: [
      'а) Аддис-Абеба',
      'б) Найроби',
      'в) Хартум',
      'г) Кампала',
    ],
  ),
  Question(
    question: '2. Какое древнее царство располагалось на территории современной Эфиопии?',
    correctAnswerIndex: 1,
    options: [
      'а) Карфаген',
      'б) Аксум',
      'в) Египет',
      'г) Мали',
    ],
  ),
  Question(
    question: '3. Какая река является важнейшей для Эфиопии?',
    correctAnswerIndex: 2,
    options: [
      'а) Конго',
      'б) Нигер',
      'в) Голубой Нил',
      'г) Замбези',
    ],
  ),
  Question(
    question: '4. Какой уникальный календарь используется в Эфиопии?',
    correctAnswerIndex: 3,
    options: [
      'а) Григорианский календарь',
      'б) Юлианский календарь',
      'в) Исламский календарь',
      'г) Эфиопский календарь',
    ],
  ),
  Question(
    question: '5. Какой праздник считается крупнейшим религиозным праздником в Эфиопии?',
    correctAnswerIndex: 0,
    options: [
      'а) Тимкат',
      'б) Рамадан',
      'в) Пасха',
      'г) Дивали',
    ],
  ),
  Question(
    question: '6. Какое знаковое географическое образование находится в Эфиопии?',
    correctAnswerIndex: 1,
    options: [
      'а) Гранд-Каньон',
      'б) Долина Афар',
      'в) Килиманджаро',
      'г) Сахара',
    ],
  ),
  Question(
    question: '7. Какая знаменитая древняя церковь вырезана в скале в Лалибеле?',
    correctAnswerIndex: 3,
    options: [
      'а) Церковь Святого Петра',
      'б) Церковь Святого Георгия',
      'в) Церковь Святого Павла',
      'г) Церковь Святого Георгия',
    ],
  ),
  Question(
    question: '8. Какой крупный регион в Эфиопии известен своими древними каменными стелами?',
    correctAnswerIndex: 0,
    options: [
      'а) Тиграй',
      'б) Амхара',
      'в) Оромия',
      'г) Афар',
    ],
  ),
  Question(
    question: '9. Какая традиционная эфиопская блюдо представляет собой тушеное мясо или овощи с пряностями?',
    correctAnswerIndex: 2,
    options: [
      'а) Таджина',
      'б) Суши',
      'в) Ват',
      'г) Пицца',
    ],
  ),
];