import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица Ирана?',
    correctAnswerIndex: 0,
    options: [
      'а) Тегеран',
      'б) Исфахан',
      'в) Шираз',
      'г) Мешхед',
    ],
  ),
  Question(
    question: '2. Как называется крупнейшая пустыня в Иране?',
    correctAnswerIndex: 2,
    options: [
      'а) Сахара',
      'б) Гоби',
      'в) Деште-Кевир',
      'г) Каракумы',
    ],
  ),
  Question(
    question: '3. Какая древняя империя существовала на территории современного Ирана?',
    correctAnswerIndex: 1,
    options: [
      'а) Римская империя',
      'б) Персидская империя',
      'в) Османская империя',
      'г) Византийская империя',
    ],
  ),
  Question(
    question: '4. Какой язык является официальным в Иране?',
    correctAnswerIndex: 3,
    options: [
      'а) Арабский',
      'б) Турецкий',
      'в) Курдский',
      'г) Персидский (фарси)',
    ],
  ),
  Question(
    question: '5. Какой праздник отмечается в Иране как Новый год?',
    correctAnswerIndex: 1,
    options: [
      'а) Рождество',
      'б) Навруз',
      'в) Ханука',
      'г) Курбан-байрам',
    ],
  ),
  Question(
    question: '6. Как называется историческая область в Иране, известная своими персидскими коврами?',
    correctAnswerIndex: 2,
    options: [
      'а) Луристан',
      'б) Мазендеран',
      'в) Кашан',
      'г) Систан',
    ],
  ),
  Question(
    question: '7. Какой великий персидский поэт написал "Шахнаме"?',
    correctAnswerIndex: 0,
    options: [
      'а) Фирдоуси',
      'б) Омар Хайям',
      'в) Саади',
      'г) Хафиз',
    ],
  ),
  Question(
    question: '8. Какой иранский город известен своими историческими башнями ветров?',
    correctAnswerIndex: 3,
    options: [
      'а) Табриз',
      'б) Кум',
      'в) Керманшах',
      'г) Йезд',
    ],
  ),
  Question(
    question: '9. Какое религиозное течение является доминирующим в Иране?',
    correctAnswerIndex: 1,
    options: [
      'а) Суннизм',
      'б) Шиизм',
      'в) Зороастризм',
      'г) Суфизм',
    ],
  ),
];
