import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица России?',
    correctAnswerIndex: 0,
    options: [
      'а) Москва',
      'б) Санкт-Петербург',
      'в) Новосибирск',
      'г) Екатеринбург',
    ],
  ),
  Question(
    question: '2. Какая самая длинная река в России?',
    correctAnswerIndex: 2,
    options: [
      'а) Обь',
      'б) Енисей',
      'в) Волга',
      'г) Лена',
    ],
  ),
  Question(
    question: '3. Как называется самый высокий пик России?',
    correctAnswerIndex: 1,
    options: [
      'а) Казбек',
      'б) Эльбрус',
      'в) Белуха',
      'г) Дыхтау',
    ],
  ),
  Question(
    question: '4. Какой знаменитый русский писатель написал роман "Война и мир"?',
    correctAnswerIndex: 3,
    options: [
      'а) Фёдор Достоевский',
      'б) Александр Пушкин',
      'в) Антон Чехов',
      'г) Лев Толстой',
    ],
  ),
  Question(
    question: '5. Какое традиционное русское блюдо состоит из мясного или овощного бульона?',
    correctAnswerIndex: 0,
    options: [
      'а) Борщ',
      'б) Суши',
      'в) Пицца',
      'г) Паста',
    ],
  ),
  Question(
    question: '6. Как называется главный театр оперы и балета в Москве?',
    correctAnswerIndex: 1,
    options: [
      'а) Мариинский театр',
      'б) Большой театр',
      'в) Александринский театр',
      'г) Малый театр',
    ],
  ),
  Question(
    question: '7. Какой русский композитор написал балет "Лебединое озеро"?',
    correctAnswerIndex: 2,
    options: [
      'а) Модест Мусоргский',
      'б) Сергей Прокофьев',
      'в) Пётр Чайковский',
      'г) Дмитрий Шостакович',
    ],
  ),
  Question(
    question: '8. Как называется традиционный русский напиток из хлеба?',
    correctAnswerIndex: 3,
    options: [
      'а) Квас',
      'б) Водка',
      'в) Самогон',
      'г) Квас',
    ],
  ),
  Question(
    question: '9. Какое озеро является самым глубоким в России и в мире?',
    correctAnswerIndex: 0,
    options: [
      'а) Байкал',
      'б) Ладожское озеро',
      'в) Онего',
      'г) Телецкое озеро',
    ],
  ),
];
