import 'package:diplom_main/Model/question_model.dart';

const List<Question> questions = [
  Question(
    question: '1. Какая столица США?',
    correctAnswerIndex: 1,
    options: [
      'а) Нью-Йорк',
      'б) Вашингтон, округ Колумбия',
      'в) Лос-Анджелес',
      'г) Чикаго',
    ],
  ),
  Question(
    question: '2. Как называется самый высокий небоскреб в США?',
    correctAnswerIndex: 0,
    options: [
      'а) Уиллис-Тауэр',
      'б) Эмпайр-стейт-билдинг',
      'в) Центр Джона Хэнкока',
      'г) Крайслер-билдинг',
    ],
  ),
  Question(
    question: '3. Какой штат является самым большим по территории в США?',
    correctAnswerIndex: 2,
    options: [
      'а) Техас',
      'б) Калифорния',
      'в) Аляска',
      'г) Монтана',
    ],
  ),
  Question(
    question: '4. Кто написал Декларацию независимости США?',
    correctAnswerIndex: 3,
    options: [
      'а) Джордж Вашингтон',
      'б) Александр Гамильтон',
      'в) Джон Адамс',
      'г) Томас Джефферсон',
    ],
  ),
  Question(
    question: '5. Какой праздник отмечается в США 4 июля?',
    correctAnswerIndex: 1,
    options: [
      'а) День труда',
      'б) День независимости',
      'в) День благодарения',
      'г) День ветеранов',
    ],
  ),
  Question(
    question: '6. Какое озеро является самым большим в США по площади?',
    correctAnswerIndex: 0,
    options: [
      'а) Верхнее озеро',
      'б) Озеро Мичиган',
      'в) Озеро Гурон',
      'г) Озеро Эри',
    ],
  ),
  Question(
    question: '7. Какой американский президент освободил рабов?',
    correctAnswerIndex: 1,
    options: [
      'а) Джордж Вашингтон',
      'б) Авраам Линкольн',
      'в) Томас Джефферсон',
      'г) Теодор Рузвельт',
    ],
  ),
  Question(
    question: '8. Как называется американский флаг?',
    correctAnswerIndex: 2,
    options: [
      'а) Звезда Давида',
      'б) Синее Знамя',
      'в) Звёзды и полосы',
      'г) Юнион Джек',
    ],
  ),
  Question(
    question: '9. Как называется самый популярный вид спорта в США?',
    correctAnswerIndex: 1,
    options: [
      'а) Футбол (соккер)',
      'б) Американский футбол',
      'в) Баскетбол',
      'г) Бейсбол',
    ],
  ),
];
