class CategoryInfo {
  final String name;
  final String description;
  final String culturalFeatures;

  CategoryInfo(this.name, this.description, this.culturalFeatures);
}

class CategoriesInfo {
  static List<CategoryInfo> continents = [
    CategoryInfo(
        'Европа',
        'Европа - шестой по площади и третий по численности населения континент, расположенный на востоке полушария.',
        'Европейская культура богата историей, литературным и художественным наследием, архитектурой и кухней.'),
    CategoryInfo(
        'Азия',
        'Азия - самый крупный по территории континент, население которого составляет более половины всего мирового населения.',
        'Азиатская культура разнообразна и уникальна, от древних традиций до современных инноваций.'),
    CategoryInfo(
        'Африка',
        'Африка - второй по величине континент, известный своим богатством природы, разнообразием культур и историческим наследием.',
        'Африканская культура отражает множество этнических групп, языков и традиций, а также богатство музыкальных стилей и ремесел.'),
    CategoryInfo(
        'Северная Америка',
        'Северная Америка - третий по величине континент, на котором располагаются США и Канада.',
        'Культурное наследие Северной Америки включает в себя разнообразие этнических групп, языков, искусств и традиций.'),
    CategoryInfo(
        'Южная Америка',
        'Южная Америка - четвёртый по величине континент, богатый природными ресурсами и разнообразием культур.',
        'Южноамериканская культура отражает многообразие этнических групп, исторических событий и природных условий.'),
    CategoryInfo(
        'Австралия',
        'Австралия - крупнейший островной континент и одна из крупнейших стран в мире, известная своей уникальной флорой и фауной, красивыми пляжами и разнообразными ландшафтами.',
        'Австралийская культура отражает богатство и разнообразие природы, многообразие этнических групп и культурных традиций.'),
  ];
}
